[{"slug":"doug-engelbart","title":"Doug Engelbart","date":1403447360488,"synopsis":"Popularly known for inventing the mouse and the word processor, he was part of the group that developed an early implementation of windowing, hypertext, and collaborative computing. Head thinker  behind the [[NLS]]."},{"slug":"federated-wiki","title":"Federated Wiki","date":1415563059020,"synopsis":"The Federated Wiki is just one instantiation of the [[Smallest Federated Wiki]] software created by [[Ward Cunningham]]. We (Reclaim Hosting) built this setup here as a baby step towards helping people play with it more under the guidance/influence of [[Mike Caulfield]], a tireless advocate of this new way of publishing."},{"slug":"find-the-beginning","title":"Find The Beginning","date":1415554327381,"synopsis":"The first page of any site is called Welcome Visitors. It is the page you see if you specify no other page in a site's URL. One click takes you to this page for any site."},{"slug":"get-a-wiki","title":"Get A Wiki","date":1415512062729,"synopsis":"* Navigate to the subdomain of your choice such as [http://hist289.federatedwiki.org hist289.federatedwiki.org]."},{"slug":"how-to-wiki","title":"How To Wiki","date":1402629730967,"synopsis":"This is our help documentation. Read a little bit. Then move on to our [http://sandbox.fed.wiki.org Sandbox] and give your new knowledge a workout. Still confused? Look through our our [[Frequently Asked Questions]]."},{"slug":"sandbox","title":"Sandbox","date":1415553873177,"synopsis":"Mostly just wanted to have a page to test out anything and everything."},{"slug":"the-hidden-history-of-online-learning","title":"The Hidden History of Online Learning","date":1415586647251,"synopsis":"This collection of articles details some of the predecessors to today's online education initiatives. "},{"slug":"the-memex","title":"The Memex","date":1415587378658,"synopsis":"Imagined by [[Vannevar Bush]] in [http://www.theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/ \"As We May Think,\"] in 1945, the memex is a desk-sized scholar workstation containing a microfilm library. Text and images are displayed on two screens, and can be annotated by hand. Most importantly, texts and images can be linked, so that bringing up a text on one screen brings up a linked text on the other. These links can be organized into trails, and the trails shared with others."},{"slug":"tim-owens","title":"Tim Owens","date":1415564877259,"synopsis":"I help run [[Reclaim Hosting]] and hope to make it as easy as possible for people to get started with [[Smallest Federated Wiki]]. That being said I have no idea what I'm doing. Let's learn together!"},{"slug":"trash","title":"trash","date":1415553873181,"synopsis":"Uploaded image"},{"slug":"user-directory","title":"User Directory","date":1415587866023,"synopsis":"Add yourself here if you have a federated wiki. Then fork this page to easily access the full neighborhood."},{"slug":"vannevar-bush","title":"Vannevar Bush","date":1415587192398,"synopsis":"Head of the Office of Science Research and Development during World War II"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1433868947943,"synopsis":"Welcome to the [[Federated Wiki]]. From this page you can find who we are and what we do. New sites provide this information and then claim the site as their own. You will need your own wiki to participate. You can [[Get A Wiki]] on the federatedwiki.org server or run your own [[Smallest Federated Wiki]] server."},{"slug":"the-potential-of-tomorrow","title":"The Potential of Tomorrow","date":1433870693622,"synopsis":"There appears to be a lot of hand-wringing about the future today, most notably when it comes to privacy and data ownership. The two extremes either promise a future filled with wonderful advancements or a future darkened a 1984 [[Big Brother]] mentality of privacy violations. I'd like to write a post unpacking some of that."},{"slug":"big-brother","title":"Big Brother","date":1433869952161,"synopsis":"A headless leader who may not even exist from the novel Nineteen Eighty-Four (1984) by George Orwell. The Party \"seeks power entirely for its own sake. We are not interested in the good of others; we are interested solely in power.\""},{"slug":"ordering-a-pizza-in-2015","title":"Ordering a Pizza in 2015","date":1433870341604,"synopsis":"Jim Groom points to a video created by the [[ACLU]] 10 years ago predicting a potential future where our data is mined in disturbing ways."},{"slug":"privacy-versus-user-experience","title":"Privacy versus User Experience","date":1433870923808,"synopsis":"Privacy and User Experience (UX) are often seen as being at odds. To build software that can predict intention a program requires data, your data."}]