[{"slug":"welcome-visitors","title":"Welcome Visitors","date":1437102280837,"synopsis":"Welcome to this [[Federated Wiki]] site. From this page you can find who we are and what we do. New sites provide this information and then claim the site as their own. You will need your own site to participate."},{"slug":"how-to-wiki","title":"How To Wiki","date":1418519515869,"synopsis":"This is our help documentation. Read a little bit. Then move on to our [http://sandbox.fed.wiki.org Sandbox] and give your new knowledge a workout. Still confused? Look through our our [[Frequently Asked Questions]]."},{"slug":"find-the-beginning","title":"Find The Beginning","date":1418315122382,"synopsis":"The first page of any site is called Welcome Visitors. It is the page you see if you specify no other page in a site's URL. One click takes you to this page for any site."},{"slug":"follow-links","title":"Follow Links","date":1418315138352,"synopsis":"You will find two kinds of links in the text of wiki pages. Internal links go between wiki pages. External links go to other places on the internet."},{"slug":"origin-server","title":"Origin Server","date":1437100818177,"synopsis":"The server that delivers the client-side javascript that starts you browsing the federated wiki is called the Origin Server. It's special. -- A browser can expect javascript to communicate with the Origin Server. However, browser vendors are skeptical of javascript that tries to communicate with other (remote) servers. There are many security and privacy implications. Federated Wiki employs several mechanisms to appear respectable to modern browsers."},{"slug":"search-sites","title":"Search Sites","date":1418315176247,"synopsis":"Search looks at the title and first paragraph of all pages in your [[Neighborhood]]. As you browse the federation more sites are added to your neighborhood so search can find more pages."},{"slug":"frequently-asked-questions","title":"Frequently Asked Questions","date":1432147162019,"synopsis":"As our end user documentation emerges we can expect there to be many questions. We will collect answers here, organize them and then use this to guide improvements."},{"slug":"dons-index-of-sites","title":"don's index of sites","date":1437101005687,"synopsis":"Sites - Donald Noyes"},{"slug":"read-history","title":"Read History","date":1348456497947,"synopsis":"The gray squares at the bottom of a page is in an area called the [[Journal]]. Click a square to see other versions of the page."},{"slug":"find-sites","title":"Find Sites","date":1417029495276,"synopsis":"When you find a federated wiki site you can browse from there to even more sites. A page from a site becomes yours when you copy it (a fork) leaving a trail back to the source and its neighbors."},{"slug":"add-text","title":"Add Text","date":1418271960045,"synopsis":"<b>Edit:</b> Double click on a paragraph to open the editor. Change as you see fit. Use [[Command-S]] to save or just move on to another place. The save is then automatic."},{"slug":"add-formatting","title":"Add Formatting","date":1418519311097,"synopsis":"In federated wiki we try to use a minimum of formatting. We're especially allergic to page formatting conventions associated with the printed-on-paper pages or the wide-screen-box-model associated with advertising optimized sites."},{"slug":"add-weird-characters","title":"Add Weird Characters","date":1418272200836,"synopsis":"Wiki stores text as UTF-8 Unicode characters. You can enter exotic characters using your computer's keyboard extension or by entering HTML entity codes."},{"slug":"add-paragraphs","title":"Add Paragraphs","date":1418271934558,"synopsis":"Click the [+] symbol at the bottom of the wiki page. This creates a gray \"factory\" at the end of the story."},{"slug":"move-paragraphs","title":"Move Paragraphs","date":1420517724555,"synopsis":"How to move paragraphs and paragraph-like items within and among pages."},{"slug":"add-pages","title":"Add Pages","date":1420517502876,"synopsis":"This wiki will create new pages on demand. Create a link to a new page, click that link, presto: new page."},{"slug":"copy-pages","title":"Copy Pages","date":1418272528830,"synopsis":"You can copy pages from remote sites into your own with a click of one button. The page becomes yours with attribution as expected."},{"slug":"import-documents","title":"Import Documents","date":1418273242527,"synopsis":"Federated wiki is just one more document format that hopes to play well with others and bring something new to the party."},{"slug":"add-videos","title":"Add Videos","date":1424535259321,"synopsis":"Add videos to wiki pages using the Video plugin which supports popular video services. See [[About Video Plugin]]"},{"slug":"about-video-plugin","title":"About Video Plugin","date":1418372809997,"synopsis":"The Video Plugin embeds a video player on a wiki page. The video itself must be uploaded to a supported video site and the key from that service used to configure the plugin. Drag and drop makes this easy in some cases."},{"slug":"remove-paragraphs","title":"Remove Paragraphs","date":1418315277880,"synopsis":"You can remove a paragraph by deleting all the text in the paragraph or by dragging it to some unwanted place."},{"slug":"remove-pages","title":"Remove Pages","date":1418315300910,"synopsis":"Federated wiki makes it easy to create new pages. These might be original to your site or copies of pages forked into your own environment. There is not yet any convenient way to delete unwanted pages."},{"slug":"review-changes","title":"Review Changes","date":1418273729209,"synopsis":"When you return to wiki you will want to remember what you changed on your site or what others have changed on their sites."},{"slug":"track-changes","title":"Track Changes","date":1418315338671,"synopsis":"You can always edit. Your edits will be stored in the browser or on the origin server if you've logged in."},{"slug":"host-a-site","title":"Host a Site","date":1437101567047,"synopsis":"If you want to share your changes with others you will need to host a site where others can find your work. You have many choices."},{"slug":"add-plugins","title":"Add Plugins","date":1418315605524,"synopsis":"Every paragraph-like item in the page's story has a type field that says how it should be displayed. "},{"slug":"track-updates","title":"Track Updates","date":1429459326945,"synopsis":"Each Federated Wiki server can be configured differently. This site, fed.wiki.org, provides experimental software supporting the ongoing wiki development. Depending on circumstances it may be ahead or behind the code on github or released by other means."},{"slug":"contribute-code","title":"Contribute Code","date":1418272497593,"synopsis":"The federated wiki application is a community open-source project founded in 2011 and hosted on GitHub. It has been organized as a series of repositories under an informal organization called fedwiki. [https://github.com/fedwiki github]"},{"slug":"sitesfedwikiorg","title":"sites.fed.wiki.org","date":1387151905542,"synopsis":"Catalog of federated wiki sites with domain names for page titles and brief descriptions tuned for search."},{"slug":"about-design","title":"About Design","date":1384133415691,"synopsis":"We're interested in making more great things. Making the same thing faster or cheaper is pretty great, but we're more interested in making fabulous things that solve many complex problems simultaneously and delight everyone in the process."},{"slug":"federated-wiki","title":"Federated Wiki","date":1437102214637,"synopsis":"Other [[Federated Wiki]] -- [[FW Sites]]"},{"slug":"sfw-history-animated","title":"SFW History Animated","date":1424537788805,"synopsis":"Paul Rodwell assembled this animation from the various github repositories we've used throughout the Smallest Federated Wiki project."},{"slug":"fw-sites","title":"FW Sites","date":1437102214653,"synopsis":"Catalog of federated wiki sites with domain names for page titles and brief descriptions tuned for search."},{"slug":"starting-points","title":"Starting Points","date":1437102347857,"synopsis":"[[Federated Wiki]]"},{"slug":"ward-cunningham","title":"Ward Cunningham","date":1435204394312,"synopsis":"I wrote [[Federated Wiki]] while I served as Nike's open-data fellow. I currently work for [[NewRelic]] in Portland, Oregon."},{"slug":"conversation-view","title":"Conversation View","date":1434201449311,"synopsis":"During the end of 2014 happening we created a script that created different view of what had changed across a group of sites, the [[Conversation Clubs]]. This used a server side script that ran every 5 minutes and created a page that provided a link for each page that opened the federated wiki with just the twins of that page in the context of the referring site."},{"slug":"about-activity-configuration","title":"About Activity Configuration","date":1433130141859,"synopsis":"The Activity plugin markup controls what and how changes found in the neighborhood are displayed."},{"slug":"about-roster-plugin","title":"About Roster Plugin","date":1437102689136,"synopsis":"This plugin prvides a hoverable/clickable [[roster of sites]] presently participation neighborhood."},{"slug":"teaching-machines","title":"Teaching Machines","date":1435112025406,"synopsis":"This site is an artifact of the Teaching Machines Happening. It's not particularly organized at the moment."},{"slug":"teaching-machines-mike-caulfield","title":"Teaching Machines (Mike Caulfield)","date":1435167029554,"synopsis":"The Teaching Machines Happening ran officially in March 2015. These were some of the topics."},{"slug":"thoughts-on-federated-wiki","title":"Thoughts on Federated Wiki","date":1434200800347,"synopsis":"Thoughts, mainly, about the development of Federated Wiki."},{"slug":"others-federated-wiki-thoughts","title":"Others Federated Wiki Thoughts","date":1434108783652,"synopsis":"Other people writing about federated wiki."},{"slug":"repository-history","title":"Repository History","date":1434107108598,"synopsis":"With splitting code out of the Smallest Federated Wiki repository some history is not carried forwards to the new repositories."},{"slug":"site-index","title":"Site Index","date":1437102925626,"synopsis":"This is a site index that gives an alphabetically sorted list of pages in the current neighborhood."},{"slug":"dat--wiki","title":"Dat + Wiki","date":1433693724554,"synopsis":"Max Ogden and Ward Cunningham join their respective projects, Dat and Wiki, by creating a server-side plugin to run DatScripts agains server local datasets."}]