[{"slug":"welcome-visitors","title":"Welcome Visitors","date":1437100590821,"synopsis":"Welcome to this [[Federated Wiki]] site. From this page you can find who we are and what we do. New sites provide this information and then claim the site as their own. You will need your own site to participate."},{"slug":"how-to-wiki","title":"How To Wiki","date":1418519515869,"synopsis":"This is our help documentation. Read a little bit. Then move on to our [http://sandbox.fed.wiki.org Sandbox] and give your new knowledge a workout. Still confused? Look through our our [[Frequently Asked Questions]]."},{"slug":"find-the-beginning","title":"Find The Beginning","date":1418315122382,"synopsis":"The first page of any site is called Welcome Visitors. It is the page you see if you specify no other page in a site's URL. One click takes you to this page for any site."},{"slug":"follow-links","title":"Follow Links","date":1418315138352,"synopsis":"You will find two kinds of links in the text of wiki pages. Internal links go between wiki pages. External links go to other places on the internet."},{"slug":"origin-server","title":"Origin Server","date":1437100818177,"synopsis":"The server that delivers the client-side javascript that starts you browsing the federated wiki is called the Origin Server. It's special. -- A browser can expect javascript to communicate with the Origin Server. However, browser vendors are skeptical of javascript that tries to communicate with other (remote) servers. There are many security and privacy implications. Federated Wiki employs several mechanisms to appear respectable to modern browsers."},{"slug":"search-sites","title":"Search Sites","date":1418315176247,"synopsis":"Search looks at the title and first paragraph of all pages in your [[Neighborhood]]. As you browse the federation more sites are added to your neighborhood so search can find more pages."},{"slug":"frequently-asked-questions","title":"Frequently Asked Questions","date":1432147162019,"synopsis":"As our end user documentation emerges we can expect there to be many questions. We will collect answers here, organize them and then use this to guide improvements."},{"slug":"dons-index-of-sites","title":"don's index of sites","date":1437101005687,"synopsis":"Sites - Donald Noyes"},{"slug":"read-history","title":"Read History","date":1348456497947,"synopsis":"The gray squares at the bottom of a page is in an area called the [[Journal]]. Click a square to see other versions of the page."},{"slug":"find-sites","title":"Find Sites","date":1417029495276,"synopsis":"When you find a federated wiki site you can browse from there to even more sites. A page from a site becomes yours when you copy it (a fork) leaving a trail back to the source and its neighbors."},{"slug":"add-text","title":"Add Text","date":1418271960045,"synopsis":"<b>Edit:</b> Double click on a paragraph to open the editor. Change as you see fit. Use [[Command-S]] to save or just move on to another place. The save is then automatic."},{"slug":"add-formatting","title":"Add Formatting","date":1418519311097,"synopsis":"In federated wiki we try to use a minimum of formatting. We're especially allergic to page formatting conventions associated with the printed-on-paper pages or the wide-screen-box-model associated with advertising optimized sites."},{"slug":"add-weird-characters","title":"Add Weird Characters","date":1418272200836,"synopsis":"Wiki stores text as UTF-8 Unicode characters. You can enter exotic characters using your computer's keyboard extension or by entering HTML entity codes."},{"slug":"add-paragraphs","title":"Add Paragraphs","date":1418271934558,"synopsis":"Click the [+] symbol at the bottom of the wiki page. This creates a gray \"factory\" at the end of the story."},{"slug":"move-paragraphs","title":"Move Paragraphs","date":1420517724555,"synopsis":"How to move paragraphs and paragraph-like items within and among pages."},{"slug":"add-pages","title":"Add Pages","date":1420517502876,"synopsis":"This wiki will create new pages on demand. Create a link to a new page, click that link, presto: new page."}]