[{"slug":"a-fedwiki-second-screen","title":"A FedWiki Second Screen","date":1419330395881,"synopsis":"(Full title: A FedWiki second screen, and why I like Likes)"},{"slug":"abstraction-of-method","title":"Abstraction of Method","date":1418598926711,"synopsis":"We reflect on the various ways this wiki separates method from quantity such that what will be done can be considered independently from the doing. We focus on dispatch as a kind of condition that is open to an increasing number of alternatives that will be managed by other than the immediate programmer. See also [[Upper Name Hierarchy]]."},{"slug":"agile-v-wiki-v-open","title":"Agile v. Wiki v. Open","date":1419330853544,"synopsis":"I consider the dimensions upon which three methods compare. In my mind they are all the same thing but I tease apart the differences in this 2009 keynote."},{"slug":"be-cool","title":"Be Cool","date":1417976529144,"synopsis":"[[Mike Caulfield]] says:"},{"slug":"before-posting-to-netnews","title":"Before Posting to NetNews","date":1419364202615,"synopsis":"Intel guidelines for posting to NetNews newsgroup from their 1995 Netiquette document. Note this advice: you should read a mailing list for one to two *months* before posting anything. [https://www.ietf.org/rfc/rfc1855.txt txt]"},{"slug":"before-the-breakthrough-moment","title":"Before the Breakthrough Moment","date":1419328561352,"synopsis":"Some groping precedes each breakthrough. Programmers who pair together support each other when the way forward is anything but obvious."},{"slug":"better-answers-to-questions","title":"Better Answers to Questions","date":1414523966142,"synopsis":"I was pleased with the quality of questions from the audience when I presented this work in person. As I recall some of my answers I realize now I could have said more."},{"slug":"blogs-plus-wikis-2003","title":"Blogs Plus Wikis, 2003","date":1415676402722,"synopsis":"Prescient quote from Ward Cunningham in 2003:"},{"slug":"brian-cox-on-leadership","title":"Brian Cox on Leadership","date":1416334409509,"synopsis":"Cox could be quoting Feynmann's QED with his one-minute summary of quantum mechanics for bbc. He did mention path integrals which QED avoided at the cost of many useless words. [http://www.bbc.co.uk/programmes/b04hvx9z bbc]"},{"slug":"caring-about-edtech","title":"Caring about EdTech","date":1419318688423,"synopsis":"\"Engagement\" is one of those buzz words used frequently in both tech and education. And I hate it. "},{"slug":"changing-the-background","title":"Changing the Background","date":1419314895496,"synopsis":"Quick customisation to change the background:"},{"slug":"changing-your-flag","title":"Changing Your Flag","date":1419329498550,"synopsis":"How I changed my anonymous flag to a photo. It's not particularly accessible to non-programmers yet, but I'm sure will be added to the SFW code soon. My instructions assume you are using a Mac."},{"slug":"collection-of-ideas","title":"Collection of Ideas","date":1416680215163,"synopsis":" "},{"slug":"concept-cafe","title":"Concept Cafe","date":1416849093000,"synopsis":"The [[Concept Cafe]] is a form of gentle dialogue. Participants -- absolutely no fence-sitters allowed -- bring a citation, a poem, a drawing, picture or object and use it to talk about something they consider very important in (for eg) patterns.  Could be something inspiring them, a fear, something considered missing..."},{"slug":"consensus-engine","title":"consensus engine","date":1415817179243,"synopsis":"Mike Caulfield's term for the way a tool like Wikipedia drives multiple opinions towards a single canonical version of reality:"},{"slug":"crawlspace-sensor","title":"Crawlspace Sensor","date":1417019939405,"synopsis":"\nThis sensor is in the crawl space underneath my daylight basement.\nIt is exposed to the outside through a half dozen ground level vents.\n\n"},{"slug":"d3-line","title":"D3 Line","date":1417019596037,"synopsis":"This is the <i>line</i> example from the [http://mbostock.github.com/d3/ d3]  distribution.  If you see an error above, don't panic, keep reading. See also [[D3 Bars]] example."},{"slug":"daylight-sensor","title":"Daylight Sensor","date":1417019596053,"synopsis":"This CdS photocell is taped to a basement window facing out \nwhere it is relatively immune to indoor lighting.\n"},{"slug":"deploying-a-wiki","title":"Deploying a wiki","date":1418025937917,"synopsis":"There are lots of ways to deploy Federated Wiki. Here we are just talking about the easiest way to deploy the Node version to it's own, otherwise empty, Ubuntu 14.04 VPS from Digital Ocean."},{"slug":"email-doesnt-self-organize","title":"Email Doesn't Self-Organize","date":1415680363674,"synopsis":"A discussion in wiki (when in [[Document Mode]]) self-organizes. As new comments and information are added to the discussion they are integrated into the main document, allowing people returning to a conversation to quickly get the current community understanding. Email conversations, on the other hand, force one to retrace the entire conversation."},{"slug":"federated-wiki-is-like-excel","title":"Federated Wiki Is Like Excel","date":1410709954505,"synopsis":"If you were explaining Excel to someone the first time, you'd probably explain to them that Excel calculates columns and rows, and then mention that updating a cell triggers other updates. The chance they would understand the huge difference that last bit makes is slim. Federated wiki has the same problem."},{"slug":"fedwiki-as-memex-journal","title":"Fedwiki as Memex-Journal","date":1418316429471,"synopsis":"If I had more programming talent to invest developing a fed wiki clone (or if I had money to buy programming talent), the direction I'd want to pursue is a sort of Hyper Card-like journal that benefits from federation, networking, and a wiki approach to life. "},{"slug":"fedwiki-the-big-picture","title":"Fedwiki: The Big Picture","date":1413311593289,"synopsis":"[[Federated Wiki Is an Application]]. It is not a web page or series of web pages. This has some implications on interface and use."},{"slug":"get-a-wiki","title":"Get A Wiki","date":1415512062729,"synopsis":"* Navigate to the subdomain of your choice such as [http://hist289.federatedwiki.org hist289.federatedwiki.org]."},{"slug":"happening-folks","title":"Happening Folks","date":1421097090073,"synopsis":"This page is maintained as the directory of participants of the course. Visit this page to load Happening participants into your neighborhood."},{"slug":"idea-fracking","title":"Idea Fracking","date":1419217516576,"synopsis":" "},{"slug":"idea-mining","title":"Idea Mining","date":1417934270811,"synopsis":"I want to think digital thoughts, even if it's uncomfortable at first to do so. "},{"slug":"johnson-on-wiki","title":"Johnson on Wiki","date":1414356195462,"synopsis":"Quote: “To be a peer progressive, then, is to live with the conviction that Wikipedia is just the beginning, that we can learn from its success to build new systems that solve problems in education, government, health, social communities, and countless other regions of human experience... That is a future worth looking forward to. Now is the time to invent it.”"},{"slug":"lateral-join","title":"Lateral Join","date":1417551290869,"synopsis":"PostgreSQL’s Powerful New Join Type: LATERAL\nby Dan Robinson on December 2, 2014. [http://blog.heapanalytics.com/postgresqls-powerful-new-join-type-lateral/ post]"},{"slug":"light-on-two-sides-of-every-room","title":"Light On Two Sides Of Every Room","date":1419253893183,"synopsis":"This is everyone's favorite pattern. We've struggled to get this content released under an open license. For now we will claim that I'm just quoting the work in this academic setting. I pulled up the nearest neighbors but no more than that."},{"slug":"lost-generation-of-genetics","title":"Lost Generation of Genetics","date":1417498793056,"synopsis":"Vannevar Bush contemplates Mendel's genetics as an example of work that never reached the right eyes. Given the large amount of information and high degree of specialization, it's likely the situation today is even worse."},{"slug":"noble-pursuit-syndrome","title":"Noble Pursuit Syndrome","date":1417202033670,"synopsis":"Eugene Eric Kim writes,\nIt seems that folks in the social change space often rationalize work by suggesting that the intentions were good, therefore the work could not have been bad. [http://eekim.com/blog/2013/08/noble-pursuit-syndrome/ post]"},{"slug":"november","title":"November","date":1416241731752,"synopsis":"November Links, in no particular order."},{"slug":"one-impossible-thing","title":"One Impossible Thing","date":1418150484437,"synopsis":"The web has produced many interesting and useful things. An argument could be made, however, that it has only produced One Impossible Thing and that thing is Wikipedia."},{"slug":"problems-vs-difficulties","title":"Problems vs. Difficulties","date":1417464911120,"synopsis":"A friend teaches integrated circuits using highly specialized tools. He reminds students that the work involves both problems and difficulties. Know the difference and don't waste his time with difficulties."},{"slug":"push-from-local-to-origin","title":"Push From Local to Origin","date":1353958065202,"synopsis":"The latest version of SFW will now push local content from the browser to the origin server."},{"slug":"recent-changes","title":"Recent Changes","date":1419329528341,"synopsis":"Here we list neighborhood pages with those most recently changed listed first. See also [[Local Changes]]."},{"slug":"recent-farm-activity","title":"Recent Farm Activity","date":1417538931004,"synopsis":"Sites hosted by this farm with activity in the last 10 days."},{"slug":"removing-a-yellow-rimmed-page","title":"Removing a Yellow-Rimmed Page","date":1418172283627,"synopsis":"To remove a yellow-rimmed page, go to [[Recent Changes]] and then click [[Local Changes]]."},{"slug":"slow-ideas","title":"Slow Ideas","date":1419008137268,"synopsis":"Some innovations spread fast. How do you speed the ones that don’t? By Atul Gawande. [http://www.newyorker.com/magazine/2013/07/29/slow-ideas newyorker]"},{"slug":"spreadsheet-wiki","title":"Spreadsheet Wiki","date":1416045175002,"synopsis":"I worked for a while at Socialtext, helping turn [[WikiCalc]] into [[SocialCalc]], but it never really became what I wanted:"},{"slug":"stream-mode","title":"Stream Mode","date":1416069699923,"synopsis":"aka StreamMode in early references - see also "},{"slug":"thinking-vs-writing","title":"Thinking vs. Writing","date":1407590850721,"synopsis":"We compare the thought process of problem solving to those of reporting solutions."},{"slug":"tony-bowden","title":"Tony Bowden","date":1419329567231,"synopsis":"Long time wiki user and abuser."},{"slug":"user-directory","title":"User Directory","date":1419052006606,"synopsis":"Add yourself here if you have a federated wiki. Then fork this page to easily access the full neighborhood."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1419328990857,"synopsis":"This is [[Tony Bowden]]'s sandbox on [[Smallest Federated Wiki]]."},{"slug":"wiki-as-accounting-system","title":"Wiki as Accounting System","date":1416045319781,"synopsis":"[http://nothing.tmtm.com/2006/09/using-a-wiki-as-an-accounting-system/ Using a Wiki as an Accounting System]"},{"slug":"wiki-recapitulation","title":"Wiki Recapitulation","date":1416682718843,"synopsis":"Recent Changes is Recent Changes, not Recent Posts. And that has implications: You may have read what is there before. It's not Google Reader where each thing is seen once and only once. Because of [[Stupid Little Edits]] they may be exactly what you have read before."},{"slug":"you-are-a-developer","title":"You Are a Developer","date":1417994567018,"synopsis":"If you are using fedwiki, you are essentially using a  [[Developer Release]]. And the trade-off is the Developer Release trade-off: you get to determine the shape of the future in exchange for putting up with some bugginess. "}]