[{"slug":"538-blindness","title":"538 Blindness","date":1414817660239,"synopsis":"Five-thirty eight has a certain kind of blindness where they don't reference long researched findings, believing numbers \"speak for themselves\". "},{"slug":"associative-trails","title":"Associative Trails","date":1413920642158,"synopsis":"From [[As We May Think]]:"},{"slug":"atari-video-game-burial","title":"Atari Video Game Burial","date":1415728353948,"synopsis":"The Atari Video Game Burial is one of those massively metaphorical and imagistic moments in history. Found when reading about history of video games. "},{"slug":"brian-cox-on-leadership","title":"Brian Cox on Leadership","date":1415729681871,"synopsis":"Podcast with Brian Cox on the subject of leadership, but more generally on how progress gets done.[http://www.bbc.co.uk/programmes/b04hvx9z bbc]"},{"slug":"carver-mead-rewrites-maxwell","title":"Carver Mead rewrites Maxwell","date":1415722505050,"synopsis":"Mead sees two important states of matter: coherent and incoherent. Before lasers there wasn't a lot of coherent to be so easily observed."},{"slug":"chromebooks-outselling-ipads-in-schools","title":"Chromebooks Outselling iPads in Schools","date":1415805916886,"synopsis":"Regarding federated wiki this means that Chromebook is likely a platform that will have to be supported for adoption in the K-12 market."},{"slug":"coffeehouse-culture","title":"Coffeehouse Culture","date":1415735643407,"synopsis":"Steven Johnson on the rise of coffeehouse culture in the 17th century. \"Until the rise of the coffeehouse you had a a population that was essentially drunk all day\". The architecture and social structure of the coffeehouse produced ways of thinking, talking, and discussing that promoted the collision of ideas."},{"slug":"crossing-the-edtech-chasm","title":"Crossing the EdTech Chasm","date":1413838317003,"synopsis":"William H. Geoghegan from IBM Academic Consulting published a paper in 1990s. Argued that in order to cross the chasm to [[Early Adopters]] that we needed to focus not on campus innovators but on getting a beachhead on the adoption side. Until then our efforts are boutique."},{"slug":"do-not-worry-about-the-credit","title":"Do Not Worry About The Credit","date":1415725025217,"synopsis":"\"It is amazing what you can accomplish if you do not care who gets the credit.\""},{"slug":"double-government","title":"Double Government","date":1415734350882,"synopsis":"Idea, proposed by [[Walter Bagehot]] in 19th century and expanded on recently by Michael Glennon in [[Vote All You Want]] that there are dual institutions in the government -- the prestige institutions, and then the efficient institutions that get things done. In Bagehot's theory of the 1860s, the monarchy and House of Lords had no power whereas the House of Commons and Cabinet were engines of change."},{"slug":"early-wikipedia-growth","title":"Early Wikipedia Growth","date":1415577098991,"synopsis":"Early Wikipedia growth was exponential and almost immediate. Some details from a recent article below."},{"slug":"eden-myth","title":"Eden Myth","date":1415744796249,"synopsis":"Eden Myths postulate a previous time free of problems. In the most common version of the myth, choices are made which lead to a currently fallen state. These myths are presented with a call to [[Return to the Garden]]."},{"slug":"even-bad-tv","title":"Even Bad TV","date":1414823084168,"synopsis":"[http://www.arthurcclarke.net/text/interviews/int12.shtml html]"},{"slug":"everything-is-broken-and-nobodys-upset","title":"Everything is Broken and Nobody's Upset","date":1413919714151,"synopsis":"Phrase from hanselman.com playing off famous Louis CK line. Notes that most software is very buggy in ways hard to explain. Some examples from there:"},{"slug":"fork-is-the-new-like","title":"Fork is the New Like","date":1416156547293,"synopsis":"A 'like' is a way of sharing attention with a new work and its author. We consider how federated wiki's 'fork' improves on the 'like' mechanism."},{"slug":"fostering-ideas-with-long-half-life","title":"Fostering Ideas With Long Half-life","date":1415730535910,"synopsis":"How do we keep an idea around? "},{"slug":"google-car-is-a-glorified-train","title":"Google Car Is a Glorified Train","date":1415284343616,"synopsis":"In [[Polanyi’s Paradox and the Shape of Employment Growth]] David Autor asserts that the Google Car is really a glorified train driving on painstakingly hand curated tracks. It doesn't drive on roads, it \"drives on maps\". It works not because it thinks, but because we have finally built an environment where it doesn't have to."},{"slug":"gps-as-idea-collision","title":"GPS as Idea Collision","date":1414683381214,"synopsis":"From steven johnson:"},{"slug":"how-innovation-happens","title":"How Innovation Happens","date":1415751449471,"synopsis":"An example of innovation is [[GPS as Idea Collision]]."},{"slug":"incomplete-proof","title":"Incomplete Proof","date":1415586875573,"synopsis":"Award-winning mathemetician by Doron Zeilberger on the problem of only publishing complete works. As stated below mathematicians output often falls after a certain age because the are trying (and failing) to solve harder problems. What would happen if we had access to that work? "},{"slug":"innovation-wiki","title":"Innovation Wiki","date":1415731510578,"synopsis":"Place to collect and link articles related to [[How Innovation Happens]] and the things that thwart it. Also interested in [[Organizational Change]]."},{"slug":"intellectual-ossification","title":"Intellectual Ossification","date":1415726087331,"synopsis":"Like everybody, intellectuals are prone to social pressure and [[Preference Falsification]]. A person chooses what to share with a public based partially on what they believe will be respected by that public. Over time this social pressure compounds -- as less and less contradictory viewpoints are shared the cost of disagreement becomes higher. "},{"slug":"johnson-on-wiki","title":"Johnson on Wiki","date":1414356195462,"synopsis":"Quote: “To be a peer progressive, then, is to live with the conviction that Wikipedia is just the beginning, that we can learn from its success to build new systems that solve problems in education, government, health, social communities, and countless other regions of human experience... That is a future worth looking forward to. Now is the time to invent it.”"},{"slug":"kevin-dunbar","title":"Kevin Dunbar","date":1414682656531,"synopsis":"Videotaped scientists, and tracked where ideas happened. "},{"slug":"knowledge-capture","title":"Knowledge Capture","date":1415032842521,"synopsis":"Knowledge capture is part of Knowledge Management (KM). "},{"slug":"knowledge-spiral","title":"Knowledge Spiral","date":1415735943631,"synopsis":"Knowledge Management model from Nonaka and Takeuchi [https://en.wikipedia.org/wiki/Knowledge_management#Dimensions wikipedia]"},{"slug":"knowledgeweb-failure","title":"KnowledgeWeb Failure","date":1414958059980,"synopsis":"James Burke of Connections fame tried to create a KnowledgeWeb to allow users multiple paths through history in a Bush-like Memex vision. It failed. "},{"slug":"liquid-network","title":"Liquid Network","date":1415730529841,"synopsis":"[[Steven Johnson]]"},{"slug":"loose-ends-are-good-starts","title":"Loose Ends Are Good Starts","date":1414855498659,"synopsis":"\"The best way is always to stop when you are going good and when you know what will happen next. If you do that every day … you will never be stuck. Always stop while you are going good and don’t think about it or worry about it until you start to write the next day. \" -- Ernest Hemingway [http://onlyhearsay.com/post/327695660 html]"},{"slug":"loved-and-lovely","title":"Loved and Lovely","date":1415734456427,"synopsis":"Adam Smith had a warmer view of human nature than many think. In his 1759 [[Theory of Moral Sentiments]] he states that the goal of humankind is not acquisition, but to be \"loved and lovely\". Russ Roberts, who runs an economics podcast, has a new book out about this subject. [http://www.econtalk.org/archives/2014/10/russ_roberts_an.html podcast]"},{"slug":"lysenkoism","title":"Lysenkoism","date":1414862344083,"synopsis":"Lysenkoism refers in a narrow sense to the anti-Mendelian theories of Soviet scientist [[Trofim Lysenko]]. More broadly it refers to any culture in which science is driven by excessive top-down, ideological pressures. In the case of Lysenkoism in the U.S.S.R a romanticization of Lysenko's \"practical\" science combined with an authoritarian government to impoverish Soviet science for decades, resulting in a lack of progress likely responsible for the deaths of millions."},{"slug":"michael-nielsen","title":"Michael Nielsen","date":1415589642583,"synopsis":"Open Science advocate. Wrote [[Reinventing Discovery]]."},{"slug":"michael-polanyi","title":"Michael Polanyi","date":1414863094642,"synopsis":"Soviet scientist, thinker, philosopher, economist famous for a couple ideas,"},{"slug":"micropublication","title":"Micropublication","date":1415588280139,"synopsis":"Circa 2007 idea from Michael Nielsen (advocate of [[Open Science]]). The idea is a sort of forkable wiki for publication of scientific articles. While not federated, it displays the slow consensus process of federated wiki."},{"slug":"mike-caulfield","title":"Mike Caulfield","date":1415734135310,"synopsis":"A page with 0 items."},{"slug":"negativity-bias","title":"Negativity Bias","date":1415663197513,"synopsis":"Why do mean and cynical comments get retweeted but more optimistic and upbeat comments stay put? The answer is apparently psychological. Hypercriticism and negativity bias push us to see negative comments as inherently more intelligent. Releated to social media, [[White Rabbit Hole]]s and other such phenomena."},{"slug":"new-years-eve-manifesto","title":"New Year's Eve Manifesto","date":1414278860635,"synopsis":"Issacson refers to Sanger's 2004 posting as a New Year's Eve manifesto."},{"slug":"open-science","title":"Open Science","date":1415589489441,"synopsis":"[[Michael Nielsen]] talks about Open Science. He starts by talking about Tim Gowers and the [[Polymath Project]]. He then talks about the failure of the Quantum Wiki (which is reminiscent of [[Scholarpedia]]), and the failure of Facebook style academic communities. "},{"slug":"organizational-change","title":"Organizational Change","date":1415733151947,"synopsis":"Your organization is ruled by [[Ten Thousand Clerks]], as part of a system of [[Double Government]]."},{"slug":"polanyis-paradox","title":"Polanyi's Paradox","date":1415032849591,"synopsis":"The problem of Tacit Knowledge, as identified by [[Michael Polanyi]]."},{"slug":"return-to-the-garden","title":"Return to the Garden","date":1415744833903,"synopsis":"\"And we've got to get ourselves / Back to the garden.\" - Joni Mitchell, describing motivation for large progressive movement."},{"slug":"slow-hunch","title":"Slow Hunch","date":1414822089613,"synopsis":"\"An idea is a network.\" - Steven Johnson"},{"slug":"slow-hunch-database","title":"Slow Hunch Database","date":1415730524728,"synopsis":"\"...create an open database of hunches, the Web 2.0 version of the traditional suggestion box. A public hunch database make every passing idea visible to everyone else. Others can comment or expand on those ideas, connecting them with their own hunches...\""},{"slug":"spontaneous-order","title":"Spontaneous Order","date":1415805877868,"synopsis":"Phrase adopted by [[Michael Polanyi]] to describe the emergent structure of scientific enterprise. Implicitly argues that centralizing scientific decisions degrades science, a reaction to the [[Lysenkoism]] of the Soviet Union of his time. "},{"slug":"ten-thousand-clerks","title":"Ten Thousand Clerks","date":1413762760804,"synopsis":"\"I do not rule Russia, ten thousand clerks do.\" -- Supposed quote of Nicolas I, Czar of Russia, shortly before his death. [http://books.google.com/books?id=URFUAAAAYAAJ&q=%22I+do+not+rule+Russia,+ten+thousand+clerks+do.%22&dq=%22I+do+not+rule+Russia,+ten+thousand+clerks+do.%22&hl=en&sa=X&ei=Hk5EVKrfOpWnyASOwIKABA&ved=0CE8Q6AEwCQ google-books]"},{"slug":"tesla-on-edison","title":"Tesla on Edison","date":1414533798420,"synopsis":"From Wikipedia:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1415728881296,"synopsis":"Welcome to the [[Smallest Federated Wiki]]. From this page you can find who we are and what we do. New sites provide this information and then claim the site as their own. You will need your own site to participate."}]